semana15jueves/picture_app/app/controllers/admins_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", "t"], ["updated_at", "2017-11-17 00:51:53.781535"], ["id", 2]]
---
  def edit
    @user = User.find(params[:id])
    @user.admin = @user.admin ? false : true
    @user.save