semana15jueves/picture_app/app/controllers/histories_controller.rb

  def user_histories
    @histories = History.where(:user_id => params[:id])
---
SELECT "histories".* FROM "histories" WHERE "histories"."user_id" = ?  [["user_id", 2]]

  def create
    @history = History.new(history_params)
    @history.user_id = current_user.id

    respond_to do |format|
      if @history.save
---
INSERT INTO "histories" ("title", "picture", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "asdasdasd"], ["picture", nil], ["content", "asdasdasd"], ["created_at", "2017-11-17 00:19:19.840093"], ["updated_at", "2017-11-17 00:19:19.840093"], ["user_id", 2]]